Repository: StablerCharacter/StoryTailor
Catalog: lib/l10n/app_*.arb
Languages: th

# developmentVersionWarning
source: This version of the application is still under heavy development, It is not advised for you to use this version of the application for production uses.
th: แอพพลิเคชั่นเวอร์ชั่นนี้กำลังอยู่ในการพัฒณา เราไม่แนะนำให้ท่านใช้เวอร์ชั่นนี้สำหรับการพัฒณาเกมจริง

source: Login
th: เข้าสู่ระบบ

source: Register
th: ลงทะเบียน

source: Email
th: อีเมล

source: Password
th: รหัสผ่าน

source: Account Settings
th: ตั้งค่าบัญชี

# continueGoogle
source: Continue with Google
th: ดำเนินการต่อด้วย Google

source: or
th: หรือ

# loginSuccess
source: Signed in successfully.
th: เข้าสู่ระบบสำเร็จ

# loggedOut
source: Signed out.
th: ออกจากระบบแล้ว

# logOut
source: Sign out
th: ออกจากระบบ

source: Projects
th: โปรเจกต์

# projectDoesntExist
source: Project does not exist
th: โปรเจกต์ไม่มีอยู่จริง

# projectDoesntExistExplaination
source: The project does not exist anymore. It may have been moved or deleted.
th: โปรเจกต์ไม่มีอยู่อีกต่อไป มันอาจถูกย้ายหรือถูกลบ

# newProjectBtn
source: Create new project...
th: สร้างโปรเจกต์ใหม่...

# newProject
source: Create new project
th: สร้างโปรเจกต์ใหม่

source: Project Name
th: ชื่อโปรเจกต์

source: Backend Engine
th: เอนจิ้นเบื้องหลัง

# canChangeLater
source: (You can change this setting later)
th: (คุณสามารถเปลี่ยนแปลงการตั้งค่านี้ในภายหลังได้)

source: Project location
th: สถานที่โปรเจกต์

# projectLocationDescription
source: Where the project will be stored. On your device locally or online on the StoryTailor cloud.
th: เป็นการเลือกว่าจะเก็บไฟล์นี้ไว้ที่ใด บนอุปกรณ์ของคุณหรือบนคลาวด์ของเรา

# locationLocal
source: Local
th: บนอุปกรณ์ของคุณ

# locationCloud
source: StoryTailor Cloud
th: คลาวด์ StoryTailor

source: Refresh
th: รีโหลด

# lastModified
source: Last modified {date}
th: แก้ไขครั้งล่าสุดเมื่อ {date}

# fileSize
source: File Size: {size}
th: ขนาดไฟล์: {size}

# errorDownloadSize
source: Error getting download size. It is not advised that you continue the installation. Please try again later. ({errorCode})
th: เกิดข้อผิดพลาดในการหาขนาดดาวน์โหลด เราไม่แนะนำให้คุณดำเนินการต่อ กรุณาลองอีกครั้งภายหลัง ({errorCode})

# downloadSize
source: Download Size: {size}
th: ขนาดดาวน์โหลด: {size}

# imageResolution
source: Image Resolution: {width}x{height}
th: ขนาดรูปภาพ: {width}x{height}

# aboutAppBtn
source: About this app
th: เกี่ยวกับแอป

source: Tutorials
th: การสอนใช้

source: Open Tutorial
th: เปิดการสอนใช้

source: Bug report
th: รายงานข้อผิดพลาด

source: Bug details
th: รายละเอียดข้อผิดพลาด

# bugDetailsPlaceholder
source: Please enter your bug report details here.
th: กรุณาใส่รายละเอียดของข้อผิดพลาด

source: Report bug
th: รายงานข้อผิดพลาด

source: Create
th: สร้าง

source: Cancel
th: ยกเลิก

source: Delete
th: ลบ

source: About
th: เกี่ยวกับแอปนี้

# appSlogan
source: Create your own stories.
th: สร้างเรื่องราวของคุณ

# aboutApp
source: StoryTailor is an application to create visual novel games easily on your phone. Which it has never been this easy to create a visual novel game on your smartphone. Made with ❤️ in Flutter. Made by Satakun Utama (lines-of-codes). Copyright (C) 2023, All rights reserved.
th: StoryTailor เป็นแอปพลิเคชั่นสร้างสรรค์เกมประเภทวิชวลโนเวล ซึ่งมันไม่เคยง่ายขนาดนี้มาก่อนในการสร้างเกมวิชวลโนเวลบนโทรศัพท์ของคุณ ทำด้วย ❤️ ใน Flutter. สร้างโดยศตคุณ อุตมะ (lines-of-codes). อยู่ภายใต้สัญญาอนุญาต GNU GPLv3

source: Assets
th: ไฟล์

# importAssetBtn
source: Import new asset...
th: นำเข้าไฟล์ใหม่...

# newBtn
source: New...
th: สร้าง...

source: Edit as Text
th: แก้ไขเป็นไฟล์ข้อความ

# renameFile
source: Rename
th: เปลี่ยนชื่อ

source: Delete File
th: ลบไฟล์

# fileDeletionConfirmation
source: Do you want to permanently delete the file?
th: คุณต้องการลบไฟล์นี้ถาวรหรือไม่

# audioNotSupported
source: This audio format is not supported on your editor platform.
th: แพลทฟอร์มปัจจุบันของคุณไม่รองรับฟอร์แมทเสียงนี้

source: Choose File
th: เลือกไฟล์

source: No File Selected
th: ไม่ได้เลือกไฟล์

# noneFile
source: None
th: ไม่มี

source: Reimport
th: นำเข้าใหม่

# reimportError
source: An error occurred while reimporting asset(s).
th: เกิดข้อผิดพลาดในระหว่างการนำเข้าไฟล์ใหม่

# reimportDoNotCloseApp
source: Reimporting asset(s), please do not close the app.
th: กำลังนำเข้าไฟล์ใหม่ กรุณาอย่าปิดแอพลิเคชั่น

source: Reimporting...
th: กำลังนำเข้าใหม่...

# assetReimported
source: Asset(s) reimported.
th: ไฟล์ถูกนำเข้าใหม่แล้ว

source: Revert
th: ย้อนกลับ

source: Audio Settings
th: การตั้งค่าเสียง

# bitrate
source: Bitrate: {bitrate}/s
th: บิทเรท: {bitrate}/s

# format
source: Format: {format}
th: ฟอร์แมท: {format}

# audioStreamNo
source: Audio Stream #{index}
th: สตรีมเสียง #{index}

# sampleRate
source: Sample Rate: {sampleRate}Hz
th: แซมเพิลเรท: {sampleRate}Hz

# codecTeller
source: Codec: {codec}
th: โคเด็ค: {codec}

# wordCodec
source: Codec
th: โคเด็ค

source: Objects
th: วัตถุ

# newObjectBtn
source: Add new object...
th: เพิ่มวัตถุใหม่...

source: Preview
th: ตัวอย่าง

# runPreviewBtn
source: Run preview...
th: ดูตัวอย่าง...

source: Project Settings
th: การตั้งค่าโปรเจกต์

# toRename
source: To rename the project, please rename it from the project list by touch/click and hold on the project.
th: ในการเปลี่ยนชื่อโปรเจกต์ กรุณาเปลี่ยนชื่อจากหน้ารายชื่อโปรเจกต์โดยการคลิกหรือแตะค้างที่โปรเจกต์

source: Rename project
th: เปลี่ยนชื่อโปรเจกต์

source: Exporting project...
th: กำลังส่งออกโปรเจกต์...

# exportProjectToZip
source: Export to Zip
th: ส่งออกเป็นไฟล์ซิป

# savedTo
source: Saved to: {filePath}
th: ถูกบันทึกไปยัง: {filePath}

source: Delete project
th: ลบโปรเจกต์

# projectDeletionConfirmation
source: Are you sure you want to permanently delete the project? The project will be gone forever and it cannot be accessed.
th: คุณแน่ใจหรือไม่ว่าจะลบโปรเจกต์นี้ถาวร โปรเจกต์จะหายไปตลอดการและไม่สามารถถูกเข้าถึงได้อีก

source: Project deleted.
th: ลบโปรเจกต์แล้ว

# projectNameCannotBeEmpty
source: The project name cannot be empty.
th: ชื่อโปรเจกต์ไม่สามารถว่างปล่าวได้

# invalidProjectName
source: Invalid project name. It must contain at least one character or number to be valid.
th: ชื่อไม่ถูกต้อง ชื่อโปรเจกต์ต้องมีอย่างน้อยหนึ่งตัวอักษรหรือตัวเลข

source: Story
th: เนื้อเรื่อง

source: Chapters
th: บท

# chapterName
source: Chapter's name
th: ชื่อบท

# newChapter
source: Add new chapter
th: เพิ่มบทใหม่

# chapterNamePlaceholder
source: The name of the chapter
th: ชื่อของบท

source: Branches
th: ราก

# newBranch
source: Add new branch
th: เพิ่มรากใหม่

# branchName
source: Branch's name
th: ชื่อราก

# branchNamePlaceholder
source: The name of the new branch
th: ชื่อของรากใหม่

source: Dialogs
th: บทพูด

source: Dialog
th: บทพูด

# newDialog
source: Add new dialog
th: สร้างบทพูดใหม่

# dialogContent
source: Dialog's content
th: ข้อความในบทพูด

# dialogContentPlaceholder
source: The content of the dialog
th: ข้อความของบทพูด

# addScene
source: Add new scene
th: เพิ่มฉากใหม่

source: Preferences
th: การตั้งค่าแอป

source: Theme
th: ธีม

# darkTheme
source: Dark
th: มืด

# lightTheme
source: Light
th: สว่าง

# systemTheme
source: System
th: ตามระบบ

source: Language
th: ภาษา

# ffmpegInstalled
source: FFmpeg for StoryTailor is installed.
th: FFmpeg สำหรับ StoryTailor ติดตั้งอยู่

# ffmpegNotInstalled
source: FFmpeg for StoryTailor is NOT installed.
th: FFmpeg สำหรับ StoryTailor ไม่ได้ถูกติดตั้งอยู่

# installFFmpeg
source: Download & Install FFmpeg
th: ดาวน์โหลดและติดตั้ง FFmpeg

# ffmpegDescription
source: FFmpeg is a program to convert audio and video files.
th: FFmpeg เป็นโปรแกรมที่ช่วยในการแปลงไฟล์เสียงและวีดีโอ

# installFailed
source: Installation failed.
th: การติดตั้งล้มเหลว

# ffmpegLinux
source: FFmpeg for Linux
th: FFmpeg สำหรับ Linux

# ffmpegLinuxInstall
source: You can run one of the following commands to install FFmpeg on Linux:
th: คุณสามารถใช้หนึ่งในคำสั่งต่อไปนี้สำหรับการติดตั้ง FFmpeg ได้:

source: Preparation
th: การเตรียมการ

source: Installation
th: การติดตั้ง

source: Download
th: ดาวน์โหลด

source: Downloading...
th: กำลังดาวน์โหลด...

source: Decompress
th: คลายการบีบอัดไฟล์

source: Decompressing...
th: กำลังคลายการบีบอัดไฟล์...

# returnToPreviousPage
source: Return
th: กลับ

source: Finished
th: เสร็จสิ้น

source: Stage Info
th: ข้อมูลฉาก

source: Stage Environment
th: สิ่งแวดล้อมฉาก

source: Stage Background
th: พื้นหลังฉาก

source: Stage Background Music
th: เพลงพื้นหลังฉาก

source: Main Menu Stage
th: ฉากหน้าเมนูหลัก

source: Story Stage
th: ฉากเนื้อเรื่อง

source: Credits Stage
th: ฉากเครดิต

# newCreditSection
source: New Section
th: ส่วนเครดิตใหม่

# creditSectionNamePlaceholder
source: Enter the name of this credit section.
th: โปรดใส่ชื่อของเครดิตส่วนนี้

# creditSectionContentPlaceholder
source: Enter the content of this credit section.
th: โปรดใส่เนื้อหาของเครดิตส่วนนี้

source: Move Up
th: เลื่อนขึ้น

source: Move Down
th: เลื่อนลง

source: Stretch Mode
th: โหมดการยืด

source: No Stretch
th: ไม่ยืด

source: Letterbox
th: เลทเทอร์บอกซ์

source: Pillarbox
th: พิลลาร์บอกซ๋

source: Scale to cover
th: ขยายให้คลุม

source: Stretch to fit
th: ยืดให้เต็ม

# devtools
source: Developer tools
th: เครื่องมือผู้พัฒนา

source: Exit Game
th: ออกจากเกม

source: Close Overlay
th: ปิดโอเวอร์เลย์
